# YDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Arc..::..YDirection Property
Arc Class See Also
---
Returns the Y direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ YDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property YDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ YDirection {
	XYZ^ get ();
}
```

# See Also
Arc Class
Autodesk.Revit.DB Namespace